
const uint16_t DefControl[]={
    600,
    900,
    600,
    500,
    1100,
    600,

    100,
    100,
    0,
    0,
    0,

    0,
    0,
    250,

    800,
    300,
    500,
    90,
    100,
    100,
    1,
    4,
    1,
    257
};

const eDefStrategy DefStrategy[]={
    {40,    0,  20, 0,  50, 0,  0},
    {60,    0,  20, 0,  30, 0,  0},
    {30,    0,  20, 0,  15, 0,  0},
    {30,    0,  20, 0,  30, 0,  0},
    {25,    0,  20, 0,  25, 0,  0},
    {80,    0,  1,  0,  25, 0,  0},
    {0,     0,  0,  0,  0,  0,  0},
    {0,     0,  0,  0,  0,  0,  0}
};

const int DefMechanic[]={
    60,
    1000,
    500,
    30,
    50,
};



/*eNameLev  NameLev[5]={
        {"Hop\274a\000"},
        {"H\270\266\275 c\270\264\275a\273\000"},
        {"Bepx c\270\264\275a\273\000"},
        {"H\270\266\275 a\263ap\270\307\000"},
        {"Bepx a\263ap\270\307\000"},
        };
*/





/*eNameDSens   NameDSens[STDSens+SCDSens]={
         {"Hacoc \272o\275\277yp1",SbOnOff,uB,TipBit,34,1},
         {"Hacoc \272o\275\277yp2",SbOnOff,uB,TipBit,34,2},
         {"Hacoc \272o\275\277yp3",SbOnOff,uB,TipBit,34,3},
         {"Hacoc \272o\275\277yp4",SbOnOff,uB,TipBit,34,4},
         {"\252p \274a\272c C",SbYesNo,uB,TipBit,0,1},
         {"\252p \274\270\275 C",SbYesNo,uB,TipBit,0,1},
         {"\252p \274a\272c \260",SbYesNo,uB,TipBit,0,1},
         {"\252p \274\270\275 \260",SbYesNo,uB,TipBit,0,1},
         {"\340oc\263e\277\272a",SbOnOff,uB,TipBit,33,1},
         {"\250o\273\270\263",SbYesNo,uB,TipBit,33,2},

         {"Pe\267ep\263 CD1",SbYesNo,uB,TipBit,0,1},
         };*/

const eNameConst NameConst[]={
/*-----------------------------------
                Параметры-солнце
------------------------------------*/
    {20,SSSS},
    {500,SSSS},
    {200,SSpS0},
    {200,SSpS0},

    {0,SSpS0},
    {0,SSpS0},
    {0,SSSS},
    {1500,SSpS0},

    {0,SSSS},
    {6000,SSpS0},
    {0,SSSS},
    {100,SSSpS},

    {0,SSSpS},
    {0,SSSpS},
    {0,SSSi},
/*-----------------------------------
                Параметры-для температуры вентиляции
------------------------------------*/
    {500,SSpS0},
    {3000,SSpS0},
    {500,SSpS0},
    {3000,SSpS0},
    {0,SSS},

/*-----------------------------------
                Параметры-обогрев
------------------------------------*/

    {500,SSpS0},
    {0,SSpS0},
    {600,SSSpS},

    {0,SSSpS},
    {1,SSSi},
/*-----------------------------------
                Параметры-влияния на Тводы
------------------------------------*/

    {10,SSSS},
    {10*256+100,SSSS},
    {-1000,SSpS0},

    {-500,SSpS0},

    {300,SSpS0},
    {2000,SSpS0},
    {0,SSpS0},

    {200,SSpS0},
    {80,SSSS},
    {200,SSpS0},

    {10,SSSS},
    {200,SSSS},
    {3000,SSpS0},

    {400,SSpS0},
    {5000,SSpS0},
    {12300,SSpS0},

    {150,SSpS0},
    {1500,SSpS0},
    {1000,SSpS0},

    {-500,SSpS0},
    {500,SSpS0},
    {0,SSSi},

    {300,SSSpS},
    {0,SSSpS},
    {0,SSpS0},




/*-----------------------------------
                Параметры-вентиляция
------------------------------------*/

    {20*256+3,SSSS},
    {50*256+5,SSSS},

    {100*256+7,SSSS},
    {1,SSSi},
    {0,SSpS0},
    {2,SSSi},
    {1500,SSpS0},
    {2000,SSpS0},
    {100,SSpS0},

    {10,SSSS},
    {-500,SSpS0},
    {40,SSSi},
    {30*256+60,SSSi},
/*-----------------------------------
                Параметры-влияние на фрамуги
------------------------------------*/

    {50*256+1,SSSS},
    {500,SSpS0},
    {2500,SSpS0},
    {5000,SSSS},
/*-----------------------------------
                Параметры-CO2
-----------------------------------*/

    {40,SSSi},
    {40,SpSSS},

/*-----------------------------------
                Параметры-Экран
------------------------------------*/
    {750,SSSS},
    {5,SSSS},
    {600,SSpS0},
    {1000,SSpS0},

    {-1000,SSpS0},
    {150,SSpS0},
    {600,SSpS0},
    {200,SSSS},

    {1000,SSpS0},
    {35,SSSi},
    {-2000,SSpS0},
    {500,SSpS0},

    {5000,SpSSS},
    {50,SSSi},
    {4,SSSi},
    {2,SSSi},

    {80,SSSi},
    {2,SSSi},
    {1,SSSi},
    {2,SSSi},
/*-----------------------------------
                Параметры- СИОД
------------------------------------*/
    {200,SSpS0},
    {40,SSSi},
    {500,SSpS0},
    {20,SSSi},
    {200,SSpS0},
    {1000,SSpS0},
    {40,SSSi},
    {4000,SSpS0},
    {20,SSSi},
    {2000,SSpS0},
    {100,SSpS0},
/*-----------------------------------
                Параметры-Вентиляторы
-----------------------------------*/

    {200,SSpS0},
    {10,SSSi},
    {10,SSSi},


/*-----------------------------------
                Параметры-воздушный обогрев
------------------------------------*/
    {200,SSpS0},
    {200,SSpS0},

/*-----------------------------------------
                Параметры - ОБЩИЕ
------------------------------------------*/

    {200,SSpS0},
    {500,SSpS0},

    {500,SSSS},

/*-----------------------------------------
                Параметры - коррекция по влажности темпеатуры задания
------------------------------------------*/

    {100,SpSSS},
    {10,SSSS},
    {50,SSSS},
    {1000,SSpS0},
    {3000,SSpS0},
    {0,SSSS},

    {400,SSpS0},
    {250,SSSS},
    {150,SSSS},
    {30,SSSi},
    {60,SSSi},

    {5,SSSpS},
    {0,SSSi}
};
