
//#define DEBUG
//#define AHU
#define AGAPOVSKIY_DOUBLE_VALVE
//#define SIO_PAUSE	1

#include "stm32f10x_Define.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_RS485.h"
#include "stm32f10x_RS485Master.h"
#include "stm32f10x_LCD240x64.h"
#include "stm32f10x_Rootines.h"
#include "stm32f10x_i2cRel.h"
#include "stm32f10x_dma.h"
#include "405_EngRus.c"
#include "65_const.c"
#include "405_ClimDef.c"
#include "405_ConfigEnRuSR.c"

#define cConfSTepl		6
//#define BIGLCD
#ifdef AHU
#define cModification	16+4
#else
#define cModification	16
#endif

/*Модификация ПО контроллера*/

#define NumCtr          1

#define cDefLanguage	1

#define DEF_PORTNUM         2012

#ifndef cLightDelay
	#define cLightDelay		40
#endif


//#define cSMech			12

#define cSTepl			8


#ifdef DEBUG
uint16_t SumAnswers=0;
char DEBUG_Buf1[4]={4,5,6,7};
char DEBUG_Buf2[4]={0,1,2,3};
#endif


uint16_t InitSystems[cSTepl][10]={
//Зона1
{5, //Отопление
2, //Вентиляция
1, //Шторы
#ifdef AHU
2,
#else
0, //UltraClima
#endif
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

//Зона2
{5, //Отопление
2, //Вентиляция
1, //Шторы
0, //UltraClima
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

//Зона3
{5, //Отопление
2, //Вентиляция
1, //Шторы
0, //UltraClima
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

//Зона4
{5, //Отопление
2, //Вентиляция
1, //Шторы
0, //UltraClima
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

//Зона5
{5, //Отопление
2, //Вентиляция
1, //Шторы
0, //UltraClima
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

//Зона6
{5, //Отопление
2, //Вентиляция
1, //Шторы
0, //UltraClima
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

//Зона7
{5, //Отопление
2, //Вентиляция
1, //Шторы
0, //UltraClima
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

//Зона8
{5, //Отопление
2, //Вентиляция
1, //Шторы
0, //UltraClima
2, //СО2
6, //Досветка
5, //СИОД
1, //Вентиляторы
0, //Резерв 1
0},//Резерв 2

};

uint16_t code MechC[cSTepl][SUM_NAME_CONF]={
{	/* Теплица 1*/
	9,	//Клапан 1
	12,	//Клапан 2
	15,	//Клапан 3
	18,	//Клапан 4
	21,	//Клапан 5

	1,	//Фрамуга Север
	3,	//Фрамуга Юг
	5,	//Экран
	0,	//Экран горизонтальный затен
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич

	33,	//СО2
	0,  //Регулятор давления
	0,  //Резерв
	11,	//Насос 1
	14,	//Насос 2

	17,	//Насос 3
	20,  //Насос 4
	23,	//Насос 5
	7,	//Вентилятор
	0,	//Нагреватель

	24,	//Насос СИОД
	8,	//Начало клапанов СИОД
	35,  //Досветка
	0,  //Распыление ядов
	0,

	0,
	0,
	0,
	0,
	37},

{	/* Теплица 2*/
	0,	//Клапан 1
	0,	//Клапан 2
	0,	//Клапан 3
	0,	//Клапан 4
	0,	//Клапан 5

	0,	//Фрамуга Север
	0,	//Фрамуга Юг
	0,	//Экран
	0,	//Экран горизонтальный затен
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич

	0,	//СО2
	0,  //Регулятор давления
	0,  //Резерв
	0,	//Насос 1
	0,	//Насос 2

	0,	//Насос 3
	0,  //Насос 4
	0,	//Насос 5
	0,	//Вентилятор
	0,	//Нагреватель

	0,	//Насос СИОД
	0,	//Начало клапанов СИОД
	0,  //Досветка
	0,  //Распыление ядов
	0,

	0,
	0,
	0,
	0,
	0},

{	/* Теплица 3*/
	0,	//Клапан 1
	0,	//Клапан 2
	0,	//Клапан 3
	0,	//Клапан 4
	0,	//Клапан 5

	0,	//Фрамуга Север
	0,	//Фрамуга Юг
	0,	//Экран
	0,	//Экран горизонтальный затен
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич

	0,	//СО2
	0,  //Регулятор давления
	0,  //Резерв
	0,	//Насос 1
	0,	//Насос 2

	0,	//Насос 3
	0,  //Насос 4
	0,	//Насос 5
	0,	//Вентилятор
	0,	//Нагреватель

	0,	//Насос СИОД
	0,	//Начало клапанов СИОД
	0,  //Досветка
	0,  //Распыление ядов
	0,

	0,
	0,
	0,
	0,
	0},

{	/* Теплица 4*/
	0,	//Клапан 1
	0,	//Клапан 2
	0,	//Клапан 3
	0,	//Клапан 4
	0,	//Клапан 5

	0,	//Фрамуга Север
	0,	//Фрамуга Юг
	0,	//Экран
	0,	//Экран горизонтальный затен
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич
	0,	//Экран вертикальный термич

	0,	//СО2
	0,  //Регулятор давления
	0,  //Резерв
	0,	//Насос 1
	0,	//Насос 2

	0,	//Насос 3
	0,  //Насос 4
	0,	//Насос 5
	0,	//Вентилятор
	0,	//Нагреватель

	0,	//Насос СИОД
	0,	//Начало клапанов СИОД
	0,  //Досветка
	0,  //Распыление ядов
	0,

	0,
	0,
	0,
	0,
	0}

};




//#define SumRelay40
#define SumRelay48

#define cNumValSiodMax	4
#define cNumValSiodDef	2

#define cnLight			5
#define VIN
//#define DEMO

/*------------------------------------------*/
#include "65_GD.c"
#include "405_Memory.c"
//#include "405_Clock.c"
#include "65_Subr.c"
#include "405_Display.c"
#include "65_screen.c"
#include "65_strategy3m.c"
#include "65_siod.c"
#include "65_control.c"
#include "405_menu.c"
#include "65_main.c"
#include "src/stm32f10x_LCD240x64.c"
#include "src/stm32f10x_Rootines.c"
#include "src/SPI.c"
#include "src/enc28j60.c"
#include "src/ip_arp_udp_tcp.c"
#include "src/simple_server.c"


