#include "syntax.h"
#include "405_ConfigEnRuSr.h"

const uint16_t InitSystems[cSTepl][10]={
//Зона1
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
#ifdef AHU
        2,
#else
        0, //UltraClima
#endif
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

//Зона2
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
        0, //UltraClima
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

//Зона3
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
        0, //UltraClima
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

//Зона4
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
        0, //UltraClima
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

//Зона5
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
        0, //UltraClima
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

//Зона6
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
        0, //UltraClima
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

//Зона7
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
        0, //UltraClima
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

//Зона8
    {5, //Отопление
        2, //Вентиляция
        1, //Шторы
        0, //UltraClima
        2, //СО2
        6, //Досветка
        5, //СИОД
        1, //Вентиляторы
        0, //Резерв 1
        0},//Резерв 2

};

const const uint16_t MechC[cSTepl][SUM_NAME_CONF]={
    {   /* Теплица 1*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
    },

    {   /* Теплица 2*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},

    {   /* Теплица 3*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},

    {   /* Теплица 4*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {   /* Теплица 5*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {   /* Теплица 6*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {   /* Теплица 7*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    {   /* Теплица 8*/
        0,  //Клапан 1
        0,  //Клапан 2
        0,  //Клапан 3
        0,  //Клапан 4
        0,  //Клапан 5

        0,  //Фрамуга Север
        0,  //Фрамуга Юг
        0,  //Экран
        0,  //Экран горизонтальный затен
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич
        0,  //Экран вертикальный термич

        0,  //СО2
        0,  //Регулятор давления
        0,  //Резерв
        0,  //Насос 1
        0,  //Насос 2

        0,  //Насос 3
        0,  //Насос 4
        0,  //Насос 5
        0,  //Вентилятор
        0,  //Нагреватель

        0,  //Насос СИОД
        0,  //Начало клапанов СИОД
        0,  //Досветка
        0,  //Распыление ядов
        0,

        0,
        0,
        0,
        0,
        0,
        0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
};
